In [3]:
import mysql.connector

try:
    connection = mysql.connector.connect(
        host='localhost',
        user='root',
        password='1234',
        database='advanced_sql')

    if connection.is_connected():
        print('Connected to MySQL database!')
    else:
        print('Failed to connect to the database.')
except mysql.connector.Error as e:
    print(f'Error connecting to MySQL: {e}')

Connected to MySQL database!

In [27]:
def execute_query(cursor, query):
    cursor = connection.cursor()
    cursor.execute(query)
    rows = cursor.fetchall()
    return rows

## Basic SQL

In [29]:
# Retrieve all columns from the "employees" table
query = 'SELECT * FROM employees'
result = execute_query(cursor, query)
for row in result:
    print(row)

(1, 'John Doe', 35, Decimal('50000.00'), 'Sales')
(2, 'Jane Smith', 28, Decimal('42000.00'), 'HR')
(3, 'Mike Johnson', 42, Decimal('60000.00'), 'Finance')
(4, 'Emily Brown', 29, Decimal('48000.00'), 'IT')
(5, 'David Lee', 38, Decimal('55000.00'), 'Sales')

In [30]:
# Find the names and ages of all employees whose age is above 30
query = 'SELECT employee_name, age FROM employees WHERE age > 30'
result = execute_query(cursor, query)
for row in result:
    print(row)

('John Doe', 35)
('Mike Johnson', 42)
('David Lee', 38)

In [31]:
# List the unique cities in the "customers" table
query = 'SELECT DISTINCT city FROM customers'
result = execute_query(cursor, query)
for row in result:
    print(row)

('New York',)
('Los Angeles',)
('Chicago',)
('Houston',)
('San Francisco',)

In [32]:
# Calculate the total number of orders in the "orders" table
query = 'SELECT COUNT(order_id) FROM orders;'
result = execute_query(cursor, query)
for row in result:
    print(row)

(5,)

In [33]:
# Find the average price of all products in the "products" table
query = 'SELECT ROUND(AVG(price),2) FROM products;'
result = execute_query(cursor, query)
for row in result:
    print(row)

(Decimal('32.62'),)

## SQL Grouping

In [34]:
# Calculate the total sales amount for each product in the "sales" table
query = 'SELECT product_id, SUM(revenue) FROM sales GROUP BY product_id;'
result = execute_query(cursor, query)
for row in result:
    print(row)

(201, Decimal('204.00'))
(202, Decimal('70.40'))
(204, Decimal('109.90'))
(205, Decimal('75.60'))

In [35]:
# Find the number of customers in each country from the "customers" table
query = """SELECT city, COUNT(*) FROM customers GROUP BY city"""
result = execute_query(cursor, query)
for row in result:
    print(row)

('New York', 1)
('Los Angeles', 1)
('Chicago', 1)
('Houston', 1)
('San Francisco', 1)

In [36]:
# Calculate the average salary for each department in the "employees" table
query = """SELECT department, ROUND(AVG(salary)) FROM employees GROUP BY department;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

('Sales', Decimal('52500'))
('HR', Decimal('42000'))
('Finance', Decimal('60000'))
('IT', Decimal('48000'))

In [37]:
# List the highest and lowest prices for each category in the "products" table
query = """SELECT category, MAX(price), MIN(price) FROM products GROUP BY category;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

('Electronics', Decimal('35.20'), Decimal('25.50'))
('Hardware', Decimal('15.80'), Decimal('15.80'))
('Toys', Decimal('10.99'), Decimal('10.99'))
('Home', Decimal('75.60'), Decimal('75.60'))

In [38]:
# Find the number of orders placed by each customer in the "orders" table
query = """SELECT customer_id, COUNT(order_id) FROM orders GROUP BY customer_id;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(101, 2)
(102, 1)
(103, 1)
(105, 1)

## SQL Aggregation

In [39]:
# Calculate the total revenue generated by the company from the "sales" table
query = """SELECT SUM(revenue) FROM sales;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(Decimal('459.90'),)

In [40]:
# Find the highest salary among all employees in the "employees" table
query = """SELECT ROUND(MAX(salary)) FROM employees;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(Decimal('60000'),)

In [41]:
# Calculate the average age of employees in the "employees" table
query = """SELECT AVG(age) FROM employees;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(Decimal('34.4000'),)

In [42]:
# Determine the number of distinct products in the "products" table
query = """SELECT COUNT(DISTINCT product_id) FROM products;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(5,)

In [43]:
# Calculate the total quantity sold for each product in the "sales" table
query = """SELECT product_id, SUM(quantity) FROM sales GROUP BY product_id;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(201, Decimal('8'))
(202, Decimal('2'))
(204, Decimal('10'))
(205, Decimal('1'))

## Advanced SQL

In [47]:
# Retrieve the top 5 employees with the highest salaries from the "employees" table
query = """SELECT * FROM employees ORDER BY salary DESC LIMIT 5;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(3, 'Mike Johnson', 42, Decimal('60000.00'), 'Finance')
(5, 'David Lee', 38, Decimal('55000.00'), 'Sales')
(1, 'John Doe', 35, Decimal('50000.00'), 'Sales')
(4, 'Emily Brown', 29, Decimal('48000.00'), 'IT')
(2, 'Jane Smith', 28, Decimal('42000.00'), 'HR')

In [49]:
# Find the names of all customers who have placed orders in the "customers" table
query = """SELECT DISTINCT c.customer_name FROM customers c
            INNER JOIN orders o ON c.customer_id = o.customer_id;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

('Alice Johnson',)
('Bob Smith',)
('Eva Lee',)
('Sophia Wang',)

In [56]:
# Calculate the running total sales for each month in the "sales" table
query = """SELECT 
    DATE_FORMAT(sale_date, '%Y-%m') AS month,
    SUM(revenue) FROM sales
    GROUP BY DATE_FORMAT(sale_date, '%Y-%m')
    ORDER BY DATE_FORMAT(sale_date, '%Y-%m');"""
result = execute_query(cursor, query)
for row in result:
    print(row)

('2023-07', Decimal('459.90'))

In [57]:
# Determine the average sales amount over a 3-month sliding window for each product in the "sales" table
query = """SELECT sale_date, product_id, revenue,
    AVG(revenue) OVER (PARTITION BY product_id ORDER BY sale_date
        RANGE BETWEEN INTERVAL '2' MONTH PRECEDING AND CURRENT ROW) FROM sales;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(datetime.date(2023, 7, 1), 201, Decimal('127.50'), Decimal('127.500000'))
(datetime.date(2023, 7, 3), 201, Decimal('76.50'), Decimal('102.000000'))
(datetime.date(2023, 7, 2), 202, Decimal('70.40'), Decimal('70.400000'))
(datetime.date(2023, 7, 3), 204, Decimal('109.90'), Decimal('109.900000'))
(datetime.date(2023, 7, 4), 205, Decimal('75.60'), Decimal('75.600000'))

In [63]:
# Rank customers based on their total order amounts in the "orders" table
query = """SELECT customer_id, SUM(order_total) AS total_order_amount,
            DENSE_RANK() OVER (ORDER BY SUM(order_total) DESC) FROM orders
            GROUP BY customer_id
            ORDER BY total_order_amount DESC;"""
result = execute_query(cursor, query)
for row in result:
    print(row)

(102, Decimal('250.75'), 1)
(101, Decimal('200.50'), 2)
(105, Decimal('150.30'), 3)
(103, Decimal('70.20'), 4)

## Window Functions in SQL

In [ ]:
# Calculate the cumulative sum of revenue for each product in the "sales" table
query = """
"""
result = execute_query(cursor, query)
for row in result:
    print(row)

In [ ]:
# Find the moving average of prices for each product over a 5-day window in the "products" table
query = """
"""
result = execute_query(cursor, query)
for row in result:
    print(row)

In [ ]:
# Assign percentile ranks to employees based on their salaries in the "employees" table
query = """
"""
result = execute_query(cursor, query)
for row in result:
    print(row)

In [ ]:
# Retrieve the previous salary for each employee in the "employees" table,
# considering 0 as the default value for the first row
query = """
"""
result = execute_query(cursor, query)
for row in result:
    print(row)

In [ ]:
# Calculate the sum of revenue for each product within a 2-day window,
# including the current row, in the "sales" table
query = """
"""
result = execute_query(cursor, query)
for row in result:
    print(row)

In [ ]:

connection.close()
print('Connection closed.')